#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <stdbool.h>

#define MAX 10000
//#define ZERO_OR_ONE 0
//#define ZERO_TO_N 1
//#define ONE_TO_N 2
#define CODE_ZERO_EXCEPTION 0x01
//============================================================================//
// 演習 4 上のコードを打ち込み、パターンが正しく処理されていることを確認しなさい。
// OK なら、次のことをやってみなさい。
//============================================================================//
//============================================================================//
// a . 「+」(1 回以上の繰り返し) に加えて「*」(0 回以上の繰り返し) も記述できるようにしてみなさい。
//============================================================================//
#define ONE_OR_MORE_ITERATIONS 0x2b
#define ZERO_OR_MORE_ITERATIONS 0x2a
//============================================================================//
// b. 「?」(直前の文字があってもなくてもよい) を実現してみなさい。
//============================================================================//
#define MAY_OR_MAY_NOT_BE_PRESENT 0x3f
//============================================================================//
// d. 文字クラス[...](...の文字のいずれかならあてはまる)を実現してみなさい。
// [^...](...のいずれでもなければ) も実現できるとなおよいです。
//============================================================================//
#define START_MALTI_PATTERN 0x5b
#define END_MALTI_PATTERN 0x5d
//============================================================================//
// e. ここまでに出て来た特殊文字の機能をなくすエスケープ記号「\」を実現しなさい
// (この文字に続いて特殊文字があった場合通常の文字として扱う)。
//============================================================================//
#define ESCAPE_SEQENCE 0x5c
//============================================================================//
// f. その他、パターンマッチにおいてあると面白いと思う好きな機能を選び実現しなさい
//============================================================================//
