//============================================================================//
// 演習 1 2 番目の (getl を含む方の) 例題を打ち込んで動かしなさい。
// OK なら、次のものをやってみなさい。
// 関数を作ったら、その動作が確認できるように呼び出してみること。
//============================================================================//

//============================================================================//
// a. getl で入力した文字列は毎回長さが違っているので、その長さを調べたい。
// 文字列の長さを調べて返す関数 int mystrlen(char s[]) を作れ。
// (ヒント: printtriangle の中で [i] == ’\0’ が成立したときの i は文字列の長さの値になっている。)
//============================================================================//

//============================================================================//
// b. printtriangleでは1行ごとに先頭の文字が削られて行が短くなっていたが、
// それと似ているが1行ごとに末尾の文字が削られて短くなっていく関数void printtriangletail(chars[]) を作れ。
// (ヒント: 文字列のどの位置でも、ナル文字を代入したらそこが文字列の終わりになる。)
//============================================================================//

//============================================================================//
// c. 文字列の中に現れる文字 c1 を文字 c2 に置き換える
// (たとえば空白を*に置き換えたりできる) 関数 void mapchar(char s[], char c1, char c2) を作れ。
//============================================================================//

//============================================================================//
// d. 文字列中の指定した文字 c1 をすべて削除して詰める関数 void deletechar(char s[],char c1) を作れ。
//============================================================================//

//============================================================================//
// e. 文字列を左右ひっくり返す関数 void reverse(char s[]) を作れ。
//============================================================================//

//============================================================================//
// f. 文字列 s2 の内容を別の文字配列 s1 にコピーする関数
// void mystrcpy(char s1[], chars2[]) を作れ。
//============================================================================//

//============================================================================//
// g. 文字列s2の内容を別の文字列s1の末尾に追加する(くっつける) 関数
// void mystrcat(chars1[], char s2[]) を作れ。
//============================================================================//

//============================================================================//
// h. 文字列 s1 と s2 を比較して等しければ 0、1 番目のものがコード順で
// 後なら 1、前なら-1 を返す関数 int mystrcmp(char s1[], char s2[]) を作れ。
//たとえば mystrcmp("abcd","abcd") → 0、mystrcmp("abcd", "abaa")
// → 1、mystrcmp("abcd", "abcz") → -1となる。
// (ヒント: 先頭から両方の文字列を比べていき、最後まで (ナル文字まで) 同じなら等しい。
// そうでなければ、違いがあったところの対応する文字の大小関係で 1 か-1 を返せばよい。)
//============================================================================//
