const int TRUE = 1;
const int FALSE = 0;
//-----------------------------------------------------------------------//
// m. その他、自分が面白いと思う計算を行う関数を作って行なえ。
//-----------------------------------------------------------------------//
int max(int data[], int n){
  int result = data[0];
  for(int i = 1; i < n; i++){
    if(data[i] > result){
      result = data[i];
    }
  }
  return result;
}

int min(int data[], int n){
  int result = data[0];
  for(int i = 1; i < n; i++){
    if(data[i] < result){
      result = data[i];
    }
  }
  return result;
}

int calc1(int n, int t){
  int result = n;
  for(int i = 1; i < t; i++){
    result = result * (n - i);
  }
  return result;
}

//-----------------------------------------------------------------------//
// a. 円錐の底面の半径と高さを与え、体積を出力する。
//-----------------------------------------------------------------------//
double a(double r, double h) {
  double s = 3.14 * pow(r, 2.0) * h;
  double v = (1/3) * s * h;
  return v;
}


//-----------------------------------------------------------------------//
// b. 実数 x を与え、その平方値を出力する。
//-----------------------------------------------------------------------//
double b(double x){
  return sqrt(x);
}


//-----------------------------------------------------------------------//
// c. 実数 x を与え、その 8 乗 (または 7 乗または 6 乗) を出力する。
//-----------------------------------------------------------------------//
double c(double x, double n){
  return pow(x,n);
}


//-----------------------------------------------------------------------//
// d. 整数を 2 つ与え、その大きい方を出力する。
//-----------------------------------------------------------------------//
int d(int a, int b){
  int array[2] = {a, b};
  return max(array, 2);
}

//-----------------------------------------------------------------------//
// e. 整数を 2 つ与え、その小さい方を出力する。
//-----------------------------------------------------------------------//
int e(int a, int b){
  int array[2] = {a, b};
  return min(array, 2);
}


//-----------------------------------------------------------------------//
// f. 整数を 3 つ与え、その最大値を出力する (または 4 つの最大でもよい)。
//-----------------------------------------------------------------------//
int f(int a, int b, int c){
  int array[3] = {a, b, c};
  return max(array, 3);
}


//-----------------------------------------------------------------------//
// g. 整数を 3 つ与え、その最小値を出力する (または 4 つの最小でもよい)。
//-----------------------------------------------------------------------//
int g(int a,int b,int c){
  int array[3] = {a, b, c};
  return min(array, 3);
}

//-----------------------------------------------------------------------//
// h. 整数を 3 つ与え (すべて異なる値とする)、中央の値を出力する。
//-----------------------------------------------------------------------//
int h(int a,int b,int c){
  int array[3] = {a, b, c};
  int result = 0;
  int x = min(array,3);
  int i = min(array,3);
  for(int i = 0; i < 3; i++){
    if(array[i] != x && array[i] != x){
      result = array[i];
    }
  }
  return result;
}

//-----------------------------------------------------------------------//
// i. 正の整数 n を与え、n の階乗を出力する。
//-----------------------------------------------------------------------//
int i(int n){
  int result = n;
  for(int i = (n - 1); i > 0; i--){
    result = result * i;
  }
  return result;
}

//-----------------------------------------------------------------------//
// j. 正の整数 n を与え、2の乗 を出力する。
//-----------------------------------------------------------------------//
int j(int n){
  int result = 2;
  if (n == 0) {
    return 1;
  }
  for(int i = n; i > 1; i--){
    result = result * 2;
  }
  return result;
}

//-----------------------------------------------------------------------//
// k. 正の整数 n, r(n ≥ r) を与え、nCr を出力する。
//-----------------------------------------------------------------------//
int k(int n, int r){
  if(r > n){
    return FALSE;
  }
  return calc1(n, r)/calc1(r, r);
}

//-----------------------------------------------------------------------//
// l. 正の整数 a, b を与え、それらの最大公約数を出力する。
//-----------------------------------------------------------------------//
int l(int a, int b){
  int array[2] = {a, b};
  int m = min(array, 2);
  int result = 1;
  for(int i = 1; i <= m; i++){
    if(a % i == 0 && b % i == 0){
      result = i;
    }
  }
  return result;
}
